import pyqrcode, os
os.system("color 5")

print("""         
                                         ██████╗ ██████╗      ██████╗ ██████╗ ██████╗ ███████╗
                                        ██╔═══██╗██╔══██╗    ██╔════╝██╔═══██╗██╔══██╗██╔════╝
                                        ██║   ██║██████╔╝    ██║     ██║   ██║██║  ██║█████╗  
                                        ██║▄▄ ██║██╔══██╗    ██║     ██║   ██║██║  ██║██╔══╝  
                                        ╚██████╔╝██║  ██║    ╚██████╗╚██████╔╝██████╔╝███████╗
                                         ╚══▀▀═╝ ╚═╝  ╚═╝     ╚═════╝ ╚═════╝ ╚═════╝ ╚══════╝                                                     
                                                                                                     BY NR""")

data = input("Entrez le texte ou le lien pour générer le code QR : ")
qr = pyqrcode.create(data)
qr.svg('qr_code.svg', scale = 10)